Revit 2024 API
OverrideGraphicSettings.SetCutLineColor Method
 Sets the cut surface line color.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public OverrideGraphicSettings SetCutLineColor(
	Color color
)
Visual Basic
Public Function SetCutLineColor ( _
	color As Color _
) As OverrideGraphicSettings
Visual C++
public:
OverrideGraphicSettings^ SetCutLineColor(
	Color^ color
)
Parameters
color
Type: Autodesk.Revit.DB.Color
 Value of the cut surface line color for the override. InvalidColorValue means no override is set.
Return Value
 Reference to the changed object.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace